Revit 2027 API
RevitLinkGraphicsSettings.GetPhaseFilterId Method
 The linked document phase filter id of RevitLinkGraphicsSettings, or InvalidElementId if there is no phase filter explicitly assigned.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetPhaseFilterId()
Public Function GetPhaseFilterId As ElementId
public:
ElementId^ GetPhaseFilterId()
member GetPhaseFilterId : unit -> ElementId
Return Value
ElementId
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace